number = int(input())
def number_to_words(n):
    ones = ["","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять",
            "одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестьнадцать","семьнадцать","восемьнадцать","девятнадцать"]
    tens = ["","","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"]
    hundreds = ["","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"]
    if n == 0:
        return "ноль"
    if n == 1000:
        return "тысяча"
    elif n < 20:
        return ones[n]
    elif n < 100:
        return tens[n // 10] + " " + ones[n % 10]
    else:
        return hundreds[n // 100] + " " + tens[(n // 10) % 10] + " " + ones[n % 10]
if 1 < number <= 1000:
    print(number_to_words(number))
else:
    print("error")
